In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
use db_project;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [4]:
%%sql

DROP TABLE IF EXISTS employees;
DROP TABLE IF EXISTS contractors;



CREATE TABLE employees (
    employee_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name  VARCHAR(50),
    last_name   VARCHAR(50),
    position    VARCHAR(50),
    salary      DECIMAL(10,2)
);

CREATE TABLE contractors (
    contractor_id INT AUTO_INCREMENT PRIMARY KEY,
    first_name    VARCHAR(50),
    last_name     VARCHAR(50),
    position      VARCHAR(50),
    hourly_rate   DECIMAL(10,2)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
INSERT INTO employees (first_name, last_name, position, salary)
VALUES
('Alice', 'Smith', 'Developer', 70000.00),
('Bob', 'Johnson', 'Developer', 75000.00),
('Charlie', 'Lee', 'Manager', 90000.00);

INSERT INTO contractors (first_name, last_name, position, hourly_rate)
VALUES
('Dave', 'Williams', 'Developer', 40.00),
('Eve', 'Brown', 'Tester', 35.00),
('Bob', 'Johnson', 'Developer', 45.00);

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.
3 rows affected.

[]

In [8]:
%%sql
select  last_name,first_name from employees
union #dont allow duplicate and we should specify value if tables not matches exactly
select last_name	,first_name from contractors

 * mysql+mysqlconnector://root:***@localhost/test
5 rows affected.

[('Smith', 'Alice'),
 ('Johnson', 'Bob'),
 ('Lee', 'Charlie'),
 ('Williams', 'Dave'),
 ('Brown', 'Eve')]

In [9]:
%%sql
select  last_name,first_name from employees
union all #allow duplicate and we should specify value if tables not matches exactly
select last_name	,first_name from contractors

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('Smith', 'Alice'),
 ('Johnson', 'Bob'),
 ('Lee', 'Charlie'),
 ('Williams', 'Dave'),
 ('Brown', 'Eve'),
 ('Johnson', 'Bob')]